---
kind: type
id: T:Autodesk.Revit.DB.Analysis.MassSurfaceDataMaterialType
source: html/b614bf20-7f12-a7f1-4b63-f151a6960c6f.htm
---
# Autodesk.Revit.DB.Analysis.MassSurfaceDataMaterialType

Indicates how the visualization material for the MassSurfaceData is calculated.

## Syntax (C#)
```csharp
public enum MassSurfaceDataMaterialType
```